// 项目的运行   背景，目标，实施
// 产品经理与项目经理
// 产品经理  想
//
// 需求分析   竞品分析   用户画像   ->调研->草图流程->线框流程图-》低保真图->高保真图->交互动效

// 项目经理：做   把控

    // 需求二次分析（分析功能与需求）-》确定数据结构-》确定技术路线（前台，后台，mysql等）-》
    //     进行人员的分配（3,2,2）-》确定时间与任务（1,2,3,4,5）-》开始实施-》后期测试-》
    // 上线-》运维



// Axure   可抛弃原型

// 兼容性问题：png图片识别的问题/float问题、a链接样式的问题、css3的特性不能用（比如hever等）（// ie8以下的浏览器、）


// 移动端适配的方法   都是wibkit内核 ios  android（深度定制改掉一些功能
// 1.版本不一样2.可以定制（小米）出现一些问题，）响应式代码冗余，国内用的不多，
// 以及各种兼容性的问题




// 学
      // 非关系数据库  （非关系数据库，处理非关系型数据库，大数据的存储，分布式）（radis  mongdb）


// 后台php，nodejs  后台语言都需要操作文件http cookie  session   图像图形  视频   数据流
//     在线视频  nodejs对视频的处理编码、解码、socket技术

// 编程思想
// 1.js如何自己构造一个对象，实现数组的类型

// 算法
// 2.js至少写出5种排序，说明优劣

// 扩展能力
// 让你翻译术语对webpack的理解以及翻译能力







